UCB_CS61_lec03.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-10 五 00:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>第三课 Java 类定义</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
</head>
<body>
<div id="content">
<h1 class="title">第三课 Java 类定义</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org92c5f1c">1. DEFINING CLASSES</a>
<ul>
<li><a href="#org953ee14">1.1. Constructors</a></li>
<li><a href="#org52fa8b3">1.2. The "this" Keyword</a></li>
<li><a href="#org4376f59">1.3. The "static" Keyword</a></li>
<li><a href="#org1fbedc4">1.4. Lifetimes of Variables</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="org92c5f1c" class="outline-2">
<h2 id="org92c5f1c"><span class="section-number-2">1</span> DEFINING CLASSES</h2>
<div class="outline-text-2" id="text-1">
<p>
An object is a repository of data.  <span class="underline">Fields</span> are variables that hold the data
stored in objects.  Fields in objects are also known as <span class="underline">instance_variables</span>.
In Java, fields are addressed much like methods are, but fields never have
parameters, and no parentheses appear after them.  For example, suppose that
amanda is a Human object.  Then amanda.introduce() is a method call, and
amanda.age is a field.  Let's write a <span class="underline">class_definition</span> for the Human class.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Human</span> {
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">age</span>;                <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">The Human's age (an integer).</span>
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">name</span>;            <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">The Human's name.</span>

  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">introduce</span>() {      <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">This is a _method_definition_.</span>
    System.out.println(<span style="color: #2d9574;">"I'm "</span> + name + <span style="color: #2d9574;">" and I'm "</span> + age + <span style="color: #2d9574;">" years old."</span>);
  }
}
</pre>
</div>

<p>
"age" and "name" are both fields of a Human object.  Now that we've defined the
Human class, we can construct as many Human objects as we want.  Each Human
object we create can have different values of age and name.  We might create
amanda by executing the following code.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #ce537a; font-weight: bold;">Human</span> <span style="color: #7590db;">amanda</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Human</span>();    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Create amanda.</span>
amanda.age = <span style="color: #a45bad;">6</span>;                <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Set amanda's fields.</span>
amanda.name = <span style="color: #2d9574;">"Amanda"</span>;
amanda.introduce();            <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">_Method_call_ has amanda introduce herself.</span>
</pre>
</div>

<pre class="example">
                    --------------
                    |      ----  |
             ---    |  age | 6|  |
      amanda |.+---&gt;|      ----  |     ------------
             ---    | name | -+--+----&gt;| "Amanda" |
                    |      ----  |     ------------
                    --------------    a String object
                    a Human object

The output is:    I'm Amanda and I'm 6 years old.
</pre>

<p>
Why is it that, inside the definition of introduce(), we don't have to write
"amanda.name" and "amanda.age"?  When we invoke "amanda.introduce()", Java
remembers that we are calling introduce() <span class="underline">on</span> the object that "amanda"
references.  The methods defined inside the Human class remember that we're
referring to amanda's name and age.  If we had written "rishi.introduce()", the
introduce method would print rishi's name and age instead.  If we want to mix
two or more objects, we can.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Human</span> {
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Include all the stuff from the previous definition of Human here.</span>

  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">copy</span>(<span style="color: #ce537a; font-weight: bold;">Human</span> <span style="color: #7590db;">original</span>) {
    age = original.age;
    name = original.name;
  }
}
</pre>
</div>

<p>
Now, "amanda.copy(rishi)" copies rishi's fields to amanda.
</p>
</div>
<div id="org953ee14" class="outline-3">
<h3 id="org953ee14"><span class="section-number-3">1.1</span> Constructors</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Let's write a constructor, a method that constructs a Human.  The constructor
won't actually contain code that does the creating; rather, Java provides a
brand new object for us right at the beginning of the constructor, and all you
have to write (if you want) in the constructor is code to initialize the new
object.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Human</span> {
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Include all the stuff from the previous definitions here.</span>

  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #bc6ec5; font-weight: bold;">Human</span>(<span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">givenName</span>) {
    age = <span style="color: #a45bad;">6</span>;
    name = givenName;
  }
}
</pre>
</div>

<p>
Notice that the constructor is named "Human", and it returns an object of type
"Human".  This constructor is called whenever we write "new Human(s)", where s
is a String reference.  Now, we can shorten amanda's coming-out party to
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #ce537a; font-weight: bold;">Human</span> <span style="color: #7590db;">amanda</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Human</span>(<span style="color: #2d9574;">"Amanda"</span>);
amanda.introduce();
</pre>
</div>

<p>
These lines accomplish precisely the same result as amanda's previous four
lines.
</p>

<p>
You might ask&#x2026;why were we able to create a Human object before we wrote a
constructor?  Java provides every class with a default constructor, which takes
no parameters and does no initializing.  Hence, when we wrote
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #ce537a; font-weight: bold;">Human</span> <span style="color: #7590db;">amanda</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Human</span>();
</pre>
</div>

<p>
we created a new, blank Human.  If the default constructor were explicitly
written, it would look like this:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #bc6ec5; font-weight: bold;">Human</span>() {
}
</pre>
</div>

<p>
Warning:  if you write your own Human constructor, even if it takes parameters,
the default constructor goes away.  If you want to have the default constructor
<span class="underline">and</span> another constructor, you must define both explicitly.
</p>

<p>
You can override the default constructor by explicitly writing your own
constructor with no parameters.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Human</span> {
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Include all the stuff from the previous definitions here.</span>

  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #bc6ec5; font-weight: bold;">Human</span>() {
    age = <span style="color: #a45bad;">0</span>;
    name = <span style="color: #2d9574;">"Untitled"</span>;
  }
}
</pre>
</div>
</div>
</div>
<div id="org52fa8b3" class="outline-3">
<h3 id="org52fa8b3"><span class="section-number-3">1.2</span> The "this" Keyword</h3>
<div class="outline-text-3" id="text-1-2">
<p>
A method invocation, like "amanda.introduce()", implicitly passes an object
(in this example, amanda) as a parameter called "this".  So we can rewrite our
last constructor as follows without changing its meaning.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #bc6ec5; font-weight: bold;">Human</span>() {
  <span style="color: #4f97d7; font-weight: bold;">this</span>.age = <span style="color: #a45bad;">0</span>;
  <span style="color: #4f97d7; font-weight: bold;">this</span>.name = <span style="color: #2d9574;">"Untitled"</span>;
}
</pre>
</div>

<p>
In this case, "this" is optional.  However, if the parameters or local
variables of a method have the same name as the fields of an object, then the
former have priority, and the "this" keyword is needed to refer to the object's
fields.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">change</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">age</span>) {
  <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">name</span> = <span style="color: #2d9574;">"Tom"</span>;

  <span style="color: #4f97d7; font-weight: bold;">this</span>.age = age;
  <span style="color: #4f97d7; font-weight: bold;">this</span>.name = name;
}
</pre>
</div>

<p>
When we call "amanda.change(11)", "this" is assigned the same value as "amanda"
before the change() method begins execution.
</p>

<pre class="example">
                                                Parameters &amp; local variables
       ---    --------------                    of change()
amanda |.+---&gt;|      ----  |                      ----            ----
       ---    |  age | 6|  |&lt;---------------------+- | this   age |11|
              |      ----  |     ------------     ----            ----
              | name | -+--+----&gt;|  Amanda  |          ----     ---------
              |      ----  |     ------------     name | -+----&gt;|  Tom  |
              --------------                           ----     ---------

</pre>

<p>
Now, when Java executes "this.age = age", it overwrites the 6 with an 11.
When Java executes "this.name = name", it overwrites amanda's name as below.
</p>

<pre class="example">
                                                Parameters &amp; local variables
       ---    --------------                    of change()
amanda |.+---&gt;|      ----  |                      ----            ----
       ---    |  age |11|  |&lt;---------------------+- | this   age |11|
              |      ----  |     ------------     ----            ----
              | name | -+--+--\  |  Amanda  |          ----
              |      ----  |  |  ------------     name | -+----&gt;---------
              --------------  |                        ----     |  Tom  |
                              \--------------------------------&gt;---------

</pre>


<pre class="example">
------------------------------------------------------
| IMPORTANT:  You CANNOT change the value of "this"! |
------------------------------------------------------
</pre>

<pre class="example">
A statement like "this = amanda;" will trigger a compile-time error.

</pre>
</div>
</div>

<div id="org4376f59" class="outline-3">
<h3 id="org4376f59"><span class="section-number-3">1.3</span> The "static" Keyword</h3>
<div class="outline-text-3" id="text-1-3">
<p>
A <span class="underline">static_field</span> is a single variable shared by a whole class of objects; its
value does not vary from object to object.  For example, if "numberOfHumans" is
the number of Human objects that have been constructed, it is not appropriate
for each object to have its own copy of this number; every time a new Human is
created, we would have to update every Human.
</p>

<p>
If we declare a field "static", there is just one field for the whole class.
Static fields are also called <span class="underline">class_variables</span>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Human</span> {
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">numberOfHumans</span>;

  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">age</span>;
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">name</span>;

  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #bc6ec5; font-weight: bold;">Human</span>() {
    numberOfHumans++;    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">The constructor increments the number by one.</span>
  }
}
</pre>
</div>

<p>
If we want to look at the variable numberOfHumans from another class, we write
it in the usual notation, but we prefix it with the class name rather than the
name of a specific object.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">kids</span> = Human.numberOfHumans / <span style="color: #a45bad;">4</span>;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Good.</span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">kids</span> = amanda.numberOfHumans / <span style="color: #a45bad;">4</span>; <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">This works too, but has nothing to</span>
                                      <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">do with amanda specifically.  Don't</span>
                                      <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">do this; it's bad (confusing) style.</span>
</pre>
</div>

<p>
System.in and System.out are other examples of static fields.
</p>

<p>
Methods can be static too.  A <span class="underline">static_method</span> doesn't implicitly pass an object
as a parameter.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Human</span> {
  ...
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">void</span> printHumans() {
    System.out.println(numberOfHumans);
  }
}

</pre>
</div>

<p>
Now, we can call "Human.printHumans()" from another class.  We can also call
"amanda.printHumans()", and it works, but it's bad style, and amanda will NOT
be passed along as "this".
</p>

<p>
The main() method is always static, because when we run a program, we are not
passing an object in.
</p>

<pre class="example">
-------------------------------------------------------
| IMPORTANT:  In a static method, THERE IS NO "this"! |
-------------------------------------------------------
</pre>

<p>
Any attempt to reference "this" will cause a compile-time error.
</p>
</div>
</div>

<div id="org1fbedc4" class="outline-3">
<h3 id="org1fbedc4"><span class="section-number-3">1.4</span> Lifetimes of Variables</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>A local variable (declared in a method) is gone forever as soon as the method
in which it's declared finishes executing.  (If it references an object, the
object might continue to exist, though.)</li>
<li>An instance variable (non-static field) lasts as long as the object exists.
An object lasts as long as there's a reference to it.</li>
<li>A class variable (static field) lasts as long as the program runs.</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
